summary1 = {
    "票据及清算":["票据","清算","交换抵用"],
    "手续费/服务费/交易费":["手续费", "手續費", "服务费", "交易费", "维护费", "維護費", "年费", "BANKCHARGES", "安装费", "证书费", "管理费", "工本费"],
    "水电及通讯费用":["电信","粤通卡","邮电费","电话费"],
    "行政及办公费用":["礼品","酒水","仓储","运费","快递","邮费"],
    "租金":["租金"],
}

summary2 = {
    "利息":["结息","利息"],
    "存款":["存款"],
    "人事费用":["社保", "工资", "公积", "年终奖", "劳务费"],
    "工程及装修款":["工程款","装修款"],
    "采购款":["家具","窗帘","材料"],
    "专业服务费":["咨询费","检测费","顾问费","设计费"],
    "交通及差旅费":["差旅","旅游","住宿"],
    "押金保证金":["保证金","押金"],
    "业务货款":["货款"],
    "保险基金收入":["保险基金"],
    "借款":["借"],
    "备用金":["备用金"],
    "报销款":["报销","报账"],
}

summary3 = {
    "税务费用":["税"],
    "往来款":["往来","存入","汇入","转入","汇出","转款","汇款","大额支付业务","转账","还款","還款","匯款","外匯""外汇", "支付申请"],
}


"""account mapping编写注意事项：
1. [list]内的字符串需省去空格、标点符号等特殊字符，只能保留中文、英文、数字，否则无法匹配
2. [list]内的字符串可以只截取原户名的一部分，只要此部分不会匹配到其它无关户名。例如：“安永华明会计师事务所（特殊普通合伙）”可以只保留“安永华明会计师事务所”
3. [list]内的字符串需尽量覆盖所有可能的变体，避免遗漏
"""
account = {
    "AGRICULTURAL BANK OF CHINA": ["AGRICULTURALBANKOFCHINA"],
    "北京大成（广州）律师事务所": ["北京大成广州律师事务所"],
    "安永华明会计师事务所（特殊普通合伙）": ["安永华明会计师事务所"],
}

